# 创建人：gw
# 开发时间：2022/6/26 11:40


"""
常用运算符：
         算术运算符：标准算术运算符（+、-、*、/、//（整除））、取余运算符（%）、幂运算符（**）
         赋值运算符:执行顺序是从右到左、支持链式赋值如a=b=c=20、支持参数赋值（+=、-=、*=、/=、//=、%=）、支持系列解包赋值（a,b,c = 10,15,20）
         比较运算符：>、<、>=、<=、==、!=,对象id的比较（is、is not）,比较运算符的结果为bool类型
         布尔运算符:(与)and, （或）or, （非）not, in, not in
         位运算符:&(位与：对应数位都是1，结果数位才是1，否则为0)、|(位或：对应数位都是0，结果数位才是0，否则为1)、<<（左移位运算符：高位溢出舍弃，低位补0）、>>（右移位运算符：低位溢出舍弃、高位补0）
运算符的优先级：算术先于位先于比较先于布尔先于赋值
"""
#算术运算符
print(9//4)
print(-9//-4)
print(-9//4)
print(9//-4)     # 整除运算是向下取整，不一定是整数部分，比如结果为负数的时候就不是结果的整数部分


print(9 % -4)
print(-9 % 4)    # 计算的公式：余数=被除数-除数*整除时的商，所以，会得到这样的结果


#赋值运算符
a, b = 10, 20
a, b = b, a
print(a, b)      # 在python中，利用解包赋值，不需要中间变量就可以完成对两个变量的值的交换


#比较运算符    一个等号，称为赋值运算符，两个等号称为比较运算符。一个变量由标识、类型、值组成。==比较的是值，要比较标识应该使用is、 is not。
a, b = 10, 20
print('a>b吗？', a > b)
print('a<b吗？', a < b)
print(a == b)
print(a is b)
a = 10
b = 10
print(a == b)
print(a is b)
print(a is not b)


list1 = [11,22,33,44]
list2 = [11,22,33,44]
print(list1 == list2)
print(list1 is list2)


#布尔运算符
s = 'helloworld'
print('w' in s)
print('k' not in s)
print('k' in s)


#位运算符
print(bin(4 & 8))
print(bin(4 | 8))
print(bin(0b100 << 1))   # 向左移动1位
print(bin(0b100 << 2))   # 向左移动2位
